app/controllers/registrations_controller.rb

INSERT INTO "users" ("userName", "password", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["userName", "krish"], ["password", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["created_at", "2023-01-05 09:24:45.734260"], ["updated_at", "2023-01-05 09:24:45.734260"]]
---
    def create
      @user = User.new(user_params)

    # if 3==3
    #   flash[:pass] = "password must have minimum 8 characters and includes alphabet, number and special character"
    #   redirect_to sign_up_path

  #  else
  #   flash[:passnot] = "pass not in format"

  #  end




     if @user.save